## 🚨 PRODUCTION Terraform Plan

**⚠️ WARNING: This is a PRODUCTION deployment**
**Environment**: Production
**Branch**: main
**Triggered by**: PR #70

**Please review carefully before merging!**
  
  <details><summary>Click to expand PRODUCTION plan</summary>
  
  ```hcl
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.database.aws_db_instance.database will be created
  + resource "aws_db_instance" "database" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "tfplayground_prod"
      + db_subnet_group_name                  = "production-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.0"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "production-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:04:00-mon:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Name" = "production-database"
        }
      + tags_all                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-database"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + timezone                              = (known after apply)
      + username                              = "tfplayground_user"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.database.aws_db_subnet_group.database will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "production-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "production-db-subnet-group"
        }
      + tags_all                = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-db-subnet-group"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                  = (known after apply)
    }

  # module.networking.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat-eip"
          + "Project"     = "tf-playground"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat-eip"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc                  = (known after apply)
    }

  # module.networking.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-igw"
          + "Project"     = "tf-playground"
        }
      + tags_all = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-igw"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id   = (known after apply)
    }

  # module.networking.aws_nat_gateway.main[0] will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat-gateway"
          + "Project"     = "tf-playground"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat-gateway"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.networking.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-rt"
          + "Project"     = "tf-playground"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-rt"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-rt"
          + "Project"     = "tf-playground"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-rt"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for Application Load Balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP traffic from internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS traffic from internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "production-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-alb-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-alb-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group.database will be created
  + resource "aws_security_group" "database" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS database (MySQL from webservers)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "MySQL from web server"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "production-database-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-database-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-database-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group.webserver will be created
  + resource "aws_security_group" "webserver" {
      + arn                    = (known after apply)
      + description            = "Security group for web servers (HTTP, SSH, egress)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "production-webserver-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-webserver-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-webserver-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group_rule.alb_webserver_egress will be created
  + resource "aws_security_group_rule" "alb_webserver_egress" {
      + description              = "Allow outbound traffic to webservers on port 8080"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "egress"
    }

  # module.networking.aws_security_group_rule.webserver_alb_ingress will be created
  + resource "aws_security_group_rule" "webserver_alb_ingress" {
      + description              = "Allow HTTP traffic on port 8080 from ALB"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.networking.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-subnet-1"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-subnet-1"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-subnet-2"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-subnet-2"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-subnet-1"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-subnet-1"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-subnet-2"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-subnet-2"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-vpc"
          + "Project"     = "tf-playground"
        }
      + tags_all                             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-vpc"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.secrets.aws_secretsmanager_secret.database[0] will be created
  + resource "aws_secretsmanager_secret" "database" {
      + arn                            = (known after apply)
      + description                    = "Database credentials for production environment"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-database-secret"
          + "Project"     = "tf-playground"
        }
      + tags_all                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-database-secret"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }

      + replica (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.database[0] will be created
  + resource "aws_secretsmanager_secret_version" "database" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.random_id.secret_suffix[0] will be created
  + resource "random_id" "secret_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.secrets.random_password.db_password[0] will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.ssm.aws_iam_policy.ssm_automation will be created
  + resource "aws_iam_policy" "ssm_automation" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for SSM automation execution"
      + id               = (known after apply)
      + name             = "production-ssm-automation-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ssm-automation-policy"
          + "Project"     = "tf-playground"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ssm-automation-policy"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.ssm.aws_iam_role.ssm_automation will be created
  + resource "aws_iam_role" "ssm_automation" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ssm.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "production-ssm-automation-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ssm-automation-role"
          + "Project"     = "tf-playground"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ssm-automation-role"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ssm.aws_iam_role_policy_attachment.ssm_automation will be created
  + resource "aws_iam_role_policy_attachment" "ssm_automation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "production-ssm-automation-role"
    }

  # module.ssm.aws_ssm_document.database_automation will be created
  + resource "aws_ssm_document" "database_automation" {
      + arn              = (known after apply)
      + content          = <<-EOT
            schemaVersion: '0.3'
            assumeRole: '{{ AutomationAssumeRole }}'
            description: 'Automate database initialization with schema and sample data'
            parameters:
              DatabaseEndpoint:
                type: String
                description: RDS database endpoint
              DatabaseName:
                type: String
                description: Database name
              DatabaseUsername:
                type: String
                description: Database username
              DatabasePassword:
                type: String
                description: Database password
              InstanceId:
                type: String
                description: EC2 instance ID to run commands on
              AutomationAssumeRole:
                type: String
                description: IAM role ARN for automation execution
            mainSteps:
            - name: installDependencies
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Update system packages
                    yum update -y
                    
                    # Install MariaDB client if not already installed
                    if ! command -v mysql &> /dev/null; then
                        yum install -y mariadb1011-client-utils
                    fi
                    
                    echo "Dependencies installed successfully"
            - name: createDatabaseSchema
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Set environment variables to avoid shell escaping issues
                    export DB_HOST="{{ DatabaseEndpoint }}"
                    export DB_USER="{{ DatabaseUsername }}"
                    export DB_PASS="{{ DatabasePassword }}"
                    export DB_NAME="{{ DatabaseName }}"
                    
                    # Create database schema using environment variables
                    mysql -h "$DB_HOST" -u "$DB_USER" -p"$DB_PASS" "$DB_NAME" << 'EOF'
                    CREATE TABLE IF NOT EXISTS contacts (
                        id INT AUTO_INCREMENT PRIMARY KEY,
                        name VARCHAR(100) NOT NULL,
                        email VARCHAR(100) UNIQUE NOT NULL,
                        phone VARCHAR(20),
                        created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
                    );
                    EOF
                    
                    echo "Database schema created successfully"
            - name: insertSampleData
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Set environment variables to avoid shell escaping issues
                    export DB_HOST="{{ DatabaseEndpoint }}"
                    export DB_USER="{{ DatabaseUsername }}"
                    export DB_PASS="{{ DatabasePassword }}"
                    export DB_NAME="{{ DatabaseName }}"
                    
                    # Insert sample data using environment variables
                    mysql -h "$DB_HOST" -u "$DB_USER" -p"$DB_PASS" "$DB_NAME" << 'EOF'
                    INSERT IGNORE INTO contacts (name, email, phone) VALUES
                    ('John Doe', 'john.doe@example.com', '+1-555-0101'),
                    ('Jane Smith', 'jane.smith@example.com', '+1-555-0102'),
                    ('Bob Johnson', 'bob.johnson@example.com', '+1-555-0103'),
                    ('Alice Brown', 'alice.brown@example.com', '+1-555-0104'),
                    ('Charlie Wilson', 'charlie.wilson@example.com', '+1-555-0105');
                    EOF
                    
                    echo "Sample data inserted successfully"
            - name: verifyDatabaseSetup
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Set environment variables to avoid shell escaping issues
                    export DB_HOST="{{ DatabaseEndpoint }}"
                    export DB_USER="{{ DatabaseUsername }}"
                    export DB_PASS="{{ DatabasePassword }}"
                    export DB_NAME="{{ DatabaseName }}"
                    
                    # Verify the setup using environment variables
                    COUNT=$(mysql -h "$DB_HOST" -u "$DB_USER" -p"$DB_PASS" "$DB_NAME" -s -N -e "SELECT COUNT(*) FROM contacts;")
                    echo "Database setup complete. Found $COUNT contacts in the database."
        EOT
      + created_date     = (known after apply)
      + default_version  = (known after apply)
      + description      = (known after apply)
      + document_format  = "YAML"
      + document_type    = "Automation"
      + document_version = (known after apply)
      + hash             = (known after apply)
      + hash_type        = (known after apply)
      + id               = (known after apply)
      + latest_version   = (known after apply)
      + name             = "production-database-automation"
      + owner            = (known after apply)
      + parameter        = (known after apply)
      + platform_types   = (known after apply)
      + schema_version   = (known after apply)
      + status           = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-database-automation-doc"
          + "Project"     = "tf-playground"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-database-automation-doc"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.webserver.data.template_file.user_data will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "user_data" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #!/bin/bash
            
            # Update system packages
            yum update -y
            
            # Install required packages
            yum install -y python3 python3-pip git mariadb1011-client-utils
            
            # Create application directory
            mkdir -p /var/www/webapp
            cd /var/www/webapp
            
            # Create Python virtual environment
            python3 -m venv venv
            source venv/bin/activate
            
            # Install required Python packages
            pip install flask mysql-connector-python
            
            # Create application files
            cat > app.py << 'EOF'
            from flask import Flask, jsonify
            import mysql.connector
            import os
            
            app = Flask(__name__)
            
            # Database configuration
            db_config = {
                'host': '${db_host}',
                'user': '${db_user}',
                'password': '${db_password}',
                'database': '${db_name}'
            }
            
            def get_db_connection():
                return mysql.connector.connect(**db_config)
            
            @app.route('/')
            def index():
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor(dictionary=True)
                    cursor.execute('SELECT * FROM contacts')
                    contacts = cursor.fetchall()
                    cursor.close()
                    conn.close()
                    return jsonify(contacts)
                except Exception as e:
                    return jsonify({'error': str(e)}), 500
            
            @app.route('/health')
            def health():
                return jsonify({'status': 'healthy'})
            
            if __name__ == '__main__':
                app.run(host='0.0.0.0', port=8080)
            EOF
            
            # Create systemd service file
            cat > /etc/systemd/system/webapp.service << 'EOF'
            [Unit]
            Description=Python Web Application
            After=network.target
            
            [Service]
            User=root
            WorkingDirectory=/var/www/webapp
            Environment="PATH=/var/www/webapp/venv/bin"
            ExecStart=/var/www/webapp/venv/bin/python app.py
            Restart=always
            
            [Install]
            WantedBy=multi-user.target
            EOF
            
            # Start and enable the service
            systemctl daemon-reload
            systemctl start webapp
            systemctl enable webapp
        EOT
      + vars     = {
          + "db_host"     = (known after apply)
          + "db_name"     = "tfplayground_prod"
          + "db_password" = (sensitive value)
          + "db_user"     = (sensitive value)
        }
    }

  # module.webserver.aws_eip.webserver will be created
  + resource "aws_eip" "webserver" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "production-webserver-eip"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-webserver-eip"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc                  = (known after apply)
    }

  # module.webserver.aws_iam_instance_profile.webserver will be created
  + resource "aws_iam_instance_profile" "webserver" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "production-webserver-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "production-webserver-role"
      + tags_all    = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + unique_id   = (known after apply)
    }

  # module.webserver.aws_iam_policy.webserver_rds will be created
  + resource "aws_iam_policy" "webserver_rds" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow webserver to interact with RDS database"
      + id               = (known after apply)
      + name             = "production-webserver-rds-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "rds-db:connect",
                          + "rds:DescribeDBInstances",
                          + "rds:DescribeDBClusters",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:rds:us-east-2:123324351829:db:production-*",
                          + "arn:aws:rds-db:us-east-2:123324351829:dbuser:production-*/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "production-webserver-rds-policy"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-webserver-rds-policy"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.webserver.aws_iam_policy.webserver_secrets will be created
  + resource "aws_iam_policy" "webserver_secrets" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow webserver to access database credentials in Secrets Manager"
      + id               = (known after apply)
      + name             = "production-webserver-secrets-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/production/database/credentials-*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "production-webserver-secrets-policy"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-webserver-secrets-policy"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.webserver.aws_iam_role.webserver will be created
  + resource "aws_iam_role" "webserver" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "production-webserver-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "production-webserver-role"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-webserver-role"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.webserver.aws_iam_role_policy_attachment.webserver_rds will be created
  + resource "aws_iam_role_policy_attachment" "webserver_rds" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "production-webserver-role"
    }

  # module.webserver.aws_iam_role_policy_attachment.webserver_secrets will be created
  + resource "aws_iam_role_policy_attachment" "webserver_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "production-webserver-role"
    }

  # module.webserver.aws_iam_role_policy_attachment.webserver_ssm will be created
  + resource "aws_iam_role_policy_attachment" "webserver_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "production-webserver-role"
    }

  # module.webserver.aws_instance.webserver will be created
  + resource "aws_instance" "webserver" {
      + ami                                  = "ami-06c8f2ec674c67112"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "production-webserver-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "tf-playground-production"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "production-webserver"
        }
      + tags_all                             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-webserver"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

  # module.webserver.aws_key_pair.webserver will be created
  + resource "aws_key_pair" "webserver" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "tf-playground-production"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.webserver.tls_private_key.webserver will be created
  + resource "tls_private_key" "webserver" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 40 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + application_url             = (known after apply)
  + database_endpoint           = (known after apply)
  + database_name               = "tfplayground_prod"
  + database_port               = (known after apply)
  + environment_summary         = {
      + application_url   = (known after apply)
      + database_endpoint = (known after apply)
      + environment       = "production"
      + region            = "us-east-2"
      + vpc_id            = (known after apply)
      + webserver_ip      = (known after apply)
    }
  + private_subnet_ids          = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids           = [
      + (known after apply),
      + (known after apply),
    ]
  + random_suffix               = (known after apply)
  + secret_arn                  = (known after apply)
  + secret_name                 = (known after apply)
  + ssm_automation_name         = "production-database-automation"
  + ssm_automation_role_arn     = (known after apply)
  + vpc_id                      = (known after apply)
  + webserver_instance_id       = (known after apply)
  + webserver_public_ip         = (known after apply)
  + webserver_security_group_id = (known after apply)

  ```
  
  </details>
  
  **⚠️ PRODUCTION DEPLOYMENT WARNING:**
  - This will create production infrastructure
  - Costs will be incurred
  - Ensure all changes are reviewed and approved
  - Consider testing in staging first